layer {
  name: "images"
  type: "Input"
  top: "images"
  input_param {
    shape {
      dim: 1
      dim: 3
      dim: 640
      dim: 640
    }
  }
}
layer {
  name: "focus"
  type: "Reorg"
  bottom: "images"
  top: "207"
  reorg_param {
    stride: 2
    reverse: false
  }
}
layer {
  name: "Conv_41"
  type: "Convolution"
  bottom: "207"
  top: "208"
  convolution_param {
    num_output: 32
    bias_term: true
    group: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Add_43"
  type: "Eltwise"
  bottom: "208"
  bottom: "209"
  top: "210"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Clip_44_relu6_relu"
  type: "ReLU"
  bottom: "210"
  top: "Clip_44_relu6_relu_out"
}
layer {
  name: "Clip_44_relu6_thre"
  type: "Threshold"
  bottom: "Clip_44_relu6_relu_out"
  top: "Clip_44_relu6_thre_out"
  threshold_param {
    threshold: 6.0
  }
}
layer {
  name: "Clip_44_relu6_thre_left_power"
  type: "Power"
  bottom: "Clip_44_relu6_thre_out"
  top: "Clip_44_relu6_thre_left_power_out"
  power_param {
    power: 1.0
    scale: -1.0
    shift: 1.0
  }
}
layer {
  name: "Clip_44_relu6_x_mul_thre_out"
  type: "Eltwise"
  bottom: "Clip_44_relu6_relu_out"
  bottom: "Clip_44_relu6_thre_left_power_out"
  top: "Clip_44_relu6_x_mul_thre_out_out"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Clip_44_relu6_thre_right_power"
  type: "Power"
  bottom: "Clip_44_relu6_thre_out"
  top: "Clip_44_relu6_thre_right_power_out"
  power_param {
    power: 1.0
    scale: 6.0
    shift: 0.0
  }
}
layer {
  name: "Clip_44_relu6_add"
  type: "Eltwise"
  bottom: "Clip_44_relu6_x_mul_thre_out_out"
  bottom: "Clip_44_relu6_thre_right_power_out"
  top: "211"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Mul_45"
  type: "Eltwise"
  bottom: "208"
  bottom: "211"
  top: "212"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Div_47"
  type: "Power"
  bottom: "212"
  top: "214"
  power_param {
    power: 1.0
    scale: 0.1666666716337204
    shift: 0.0
  }
}
layer {
  name: "Conv_48"
  type: "Convolution"
  bottom: "214"
  top: "215"
  convolution_param {
    num_output: 64
    bias_term: true
    group: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    dilation: 1
  }
}
layer {
  name: "Add_50"
  type: "Eltwise"
  bottom: "215"
  bottom: "209"
  top: "217"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Clip_51_relu6_relu"
  type: "ReLU"
  bottom: "217"
  top: "Clip_51_relu6_relu_out"
}
layer {
  name: "Clip_51_relu6_thre"
  type: "Threshold"
  bottom: "Clip_51_relu6_relu_out"
  top: "Clip_51_relu6_thre_out"
  threshold_param {
    threshold: 6.0
  }
}
layer {
  name: "Clip_51_relu6_thre_left_power"
  type: "Power"
  bottom: "Clip_51_relu6_thre_out"
  top: "Clip_51_relu6_thre_left_power_out"
  power_param {
    power: 1.0
    scale: -1.0
    shift: 1.0
  }
}
layer {
  name: "Clip_51_relu6_x_mul_thre_out"
  type: "Eltwise"
  bottom: "Clip_51_relu6_relu_out"
  bottom: "Clip_51_relu6_thre_left_power_out"
  top: "Clip_51_relu6_x_mul_thre_out_out"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Clip_51_relu6_thre_right_power"
  type: "Power"
  bottom: "Clip_51_relu6_thre_out"
  top: "Clip_51_relu6_thre_right_power_out"
  power_param {
    power: 1.0
    scale: 6.0
    shift: 0.0
  }
}
layer {
  name: "Clip_51_relu6_add"
  type: "Eltwise"
  bottom: "Clip_51_relu6_x_mul_thre_out_out"
  bottom: "Clip_51_relu6_thre_right_power_out"
  top: "218"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Mul_52"
  type: "Eltwise"
  bottom: "215"
  bottom: "218"
  top: "219"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Div_54"
  type: "Power"
  bottom: "219"
  top: "221"
  power_param {
    power: 1.0
    scale: 0.1666666716337204
    shift: 0.0
  }
}
layer {
  name: "Conv_55"
  type: "Convolution"
  bottom: "221"
  top: "222"
  convolution_param {
    num_output: 32
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Add_57"
  type: "Eltwise"
  bottom: "222"
  bottom: "209"
  top: "224"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Clip_58_relu6_relu"
  type: "ReLU"
  bottom: "224"
  top: "Clip_58_relu6_relu_out"
}
layer {
  name: "Clip_58_relu6_thre"
  type: "Threshold"
  bottom: "Clip_58_relu6_relu_out"
  top: "Clip_58_relu6_thre_out"
  threshold_param {
    threshold: 6.0
  }
}
layer {
  name: "Clip_58_relu6_thre_left_power"
  type: "Power"
  bottom: "Clip_58_relu6_thre_out"
  top: "Clip_58_relu6_thre_left_power_out"
  power_param {
    power: 1.0
    scale: -1.0
    shift: 1.0
  }
}
layer {
  name: "Clip_58_relu6_x_mul_thre_out"
  type: "Eltwise"
  bottom: "Clip_58_relu6_relu_out"
  bottom: "Clip_58_relu6_thre_left_power_out"
  top: "Clip_58_relu6_x_mul_thre_out_out"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Clip_58_relu6_thre_right_power"
  type: "Power"
  bottom: "Clip_58_relu6_thre_out"
  top: "Clip_58_relu6_thre_right_power_out"
  power_param {
    power: 1.0
    scale: 6.0
    shift: 0.0
  }
}
layer {
  name: "Clip_58_relu6_add"
  type: "Eltwise"
  bottom: "Clip_58_relu6_x_mul_thre_out_out"
  bottom: "Clip_58_relu6_thre_right_power_out"
  top: "225"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Mul_59"
  type: "Eltwise"
  bottom: "222"
  bottom: "225"
  top: "226"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Div_61"
  type: "Power"
  bottom: "226"
  top: "228"
  power_param {
    power: 1.0
    scale: 0.1666666716337204
    shift: 0.0
  }
}
layer {
  name: "Conv_62"
  type: "Convolution"
  bottom: "228"
  top: "229"
  convolution_param {
    num_output: 32
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Add_64"
  type: "Eltwise"
  bottom: "229"
  bottom: "209"
  top: "231"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Clip_65_relu6_relu"
  type: "ReLU"
  bottom: "231"
  top: "Clip_65_relu6_relu_out"
}
layer {
  name: "Clip_65_relu6_thre"
  type: "Threshold"
  bottom: "Clip_65_relu6_relu_out"
  top: "Clip_65_relu6_thre_out"
  threshold_param {
    threshold: 6.0
  }
}
layer {
  name: "Clip_65_relu6_thre_left_power"
  type: "Power"
  bottom: "Clip_65_relu6_thre_out"
  top: "Clip_65_relu6_thre_left_power_out"
  power_param {
    power: 1.0
    scale: -1.0
    shift: 1.0
  }
}
layer {
  name: "Clip_65_relu6_x_mul_thre_out"
  type: "Eltwise"
  bottom: "Clip_65_relu6_relu_out"
  bottom: "Clip_65_relu6_thre_left_power_out"
  top: "Clip_65_relu6_x_mul_thre_out_out"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Clip_65_relu6_thre_right_power"
  type: "Power"
  bottom: "Clip_65_relu6_thre_out"
  top: "Clip_65_relu6_thre_right_power_out"
  power_param {
    power: 1.0
    scale: 6.0
    shift: 0.0
  }
}
layer {
  name: "Clip_65_relu6_add"
  type: "Eltwise"
  bottom: "Clip_65_relu6_x_mul_thre_out_out"
  bottom: "Clip_65_relu6_thre_right_power_out"
  top: "232"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Mul_66"
  type: "Eltwise"
  bottom: "229"
  bottom: "232"
  top: "233"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Div_68"
  type: "Power"
  bottom: "233"
  top: "235"
  power_param {
    power: 1.0
    scale: 0.1666666716337204
    shift: 0.0
  }
}
layer {
  name: "Conv_69"
  type: "Convolution"
  bottom: "235"
  top: "236"
  convolution_param {
    num_output: 32
    bias_term: true
    group: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Add_71"
  type: "Eltwise"
  bottom: "236"
  bottom: "209"
  top: "238"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Clip_72_relu6_relu"
  type: "ReLU"
  bottom: "238"
  top: "Clip_72_relu6_relu_out"
}
layer {
  name: "Clip_72_relu6_thre"
  type: "Threshold"
  bottom: "Clip_72_relu6_relu_out"
  top: "Clip_72_relu6_thre_out"
  threshold_param {
    threshold: 6.0
  }
}
layer {
  name: "Clip_72_relu6_thre_left_power"
  type: "Power"
  bottom: "Clip_72_relu6_thre_out"
  top: "Clip_72_relu6_thre_left_power_out"
  power_param {
    power: 1.0
    scale: -1.0
    shift: 1.0
  }
}
layer {
  name: "Clip_72_relu6_x_mul_thre_out"
  type: "Eltwise"
  bottom: "Clip_72_relu6_relu_out"
  bottom: "Clip_72_relu6_thre_left_power_out"
  top: "Clip_72_relu6_x_mul_thre_out_out"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Clip_72_relu6_thre_right_power"
  type: "Power"
  bottom: "Clip_72_relu6_thre_out"
  top: "Clip_72_relu6_thre_right_power_out"
  power_param {
    power: 1.0
    scale: 6.0
    shift: 0.0
  }
}
layer {
  name: "Clip_72_relu6_add"
  type: "Eltwise"
  bottom: "Clip_72_relu6_x_mul_thre_out_out"
  bottom: "Clip_72_relu6_thre_right_power_out"
  top: "239"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Mul_73"
  type: "Eltwise"
  bottom: "236"
  bottom: "239"
  top: "240"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Div_75"
  type: "Power"
  bottom: "240"
  top: "242"
  power_param {
    power: 1.0
    scale: 0.1666666716337204
    shift: 0.0
  }
}
layer {
  name: "Add_76"
  type: "Eltwise"
  bottom: "228"
  bottom: "242"
  top: "243"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Conv_77"
  type: "Convolution"
  bottom: "243"
  top: "244"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Conv_78"
  type: "Convolution"
  bottom: "221"
  top: "245"
  convolution_param {
    num_output: 32
    bias_term: false
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Concat_79"
  type: "Concat"
  bottom: "244"
  bottom: "245"
  top: "246"
  concat_param {
    axis: 1
  }
}
layer {
  name: "BatchNormalization_80_bn"
  type: "BatchNorm"
  bottom: "246"
  top: "247"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "BatchNormalization_80"
  type: "Scale"
  bottom: "247"
  top: "247"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "LeakyRelu_81"
  type: "ReLU"
  bottom: "247"
  top: "248"
  relu_param {
    negative_slope: 0.10000000149011612
  }
}
layer {
  name: "Conv_82"
  type: "Convolution"
  bottom: "248"
  top: "249"
  convolution_param {
    num_output: 64
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Add_84"
  type: "Eltwise"
  bottom: "249"
  bottom: "209"
  top: "251"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Clip_85_relu6_relu"
  type: "ReLU"
  bottom: "251"
  top: "Clip_85_relu6_relu_out"
}
layer {
  name: "Clip_85_relu6_thre"
  type: "Threshold"
  bottom: "Clip_85_relu6_relu_out"
  top: "Clip_85_relu6_thre_out"
  threshold_param {
    threshold: 6.0
  }
}
layer {
  name: "Clip_85_relu6_thre_left_power"
  type: "Power"
  bottom: "Clip_85_relu6_thre_out"
  top: "Clip_85_relu6_thre_left_power_out"
  power_param {
    power: 1.0
    scale: -1.0
    shift: 1.0
  }
}
layer {
  name: "Clip_85_relu6_x_mul_thre_out"
  type: "Eltwise"
  bottom: "Clip_85_relu6_relu_out"
  bottom: "Clip_85_relu6_thre_left_power_out"
  top: "Clip_85_relu6_x_mul_thre_out_out"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Clip_85_relu6_thre_right_power"
  type: "Power"
  bottom: "Clip_85_relu6_thre_out"
  top: "Clip_85_relu6_thre_right_power_out"
  power_param {
    power: 1.0
    scale: 6.0
    shift: 0.0
  }
}
layer {
  name: "Clip_85_relu6_add"
  type: "Eltwise"
  bottom: "Clip_85_relu6_x_mul_thre_out_out"
  bottom: "Clip_85_relu6_thre_right_power_out"
  top: "252"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Mul_86"
  type: "Eltwise"
  bottom: "249"
  bottom: "252"
  top: "253"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Div_88"
  type: "Power"
  bottom: "253"
  top: "255"
  power_param {
    power: 1.0
    scale: 0.1666666716337204
    shift: 0.0
  }
}
layer {
  name: "Conv_89"
  type: "Convolution"
  bottom: "255"
  top: "256"
  convolution_param {
    num_output: 128
    bias_term: true
    group: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    dilation: 1
  }
}
layer {
  name: "Add_91"
  type: "Eltwise"
  bottom: "256"
  bottom: "209"
  top: "258"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Clip_92_relu6_relu"
  type: "ReLU"
  bottom: "258"
  top: "Clip_92_relu6_relu_out"
}
layer {
  name: "Clip_92_relu6_thre"
  type: "Threshold"
  bottom: "Clip_92_relu6_relu_out"
  top: "Clip_92_relu6_thre_out"
  threshold_param {
    threshold: 6.0
  }
}
layer {
  name: "Clip_92_relu6_thre_left_power"
  type: "Power"
  bottom: "Clip_92_relu6_thre_out"
  top: "Clip_92_relu6_thre_left_power_out"
  power_param {
    power: 1.0
    scale: -1.0
    shift: 1.0
  }
}
layer {
  name: "Clip_92_relu6_x_mul_thre_out"
  type: "Eltwise"
  bottom: "Clip_92_relu6_relu_out"
  bottom: "Clip_92_relu6_thre_left_power_out"
  top: "Clip_92_relu6_x_mul_thre_out_out"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Clip_92_relu6_thre_right_power"
  type: "Power"
  bottom: "Clip_92_relu6_thre_out"
  top: "Clip_92_relu6_thre_right_power_out"
  power_param {
    power: 1.0
    scale: 6.0
    shift: 0.0
  }
}
layer {
  name: "Clip_92_relu6_add"
  type: "Eltwise"
  bottom: "Clip_92_relu6_x_mul_thre_out_out"
  bottom: "Clip_92_relu6_thre_right_power_out"
  top: "259"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Mul_93"
  type: "Eltwise"
  bottom: "256"
  bottom: "259"
  top: "260"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Div_95"
  type: "Power"
  bottom: "260"
  top: "262"
  power_param {
    power: 1.0
    scale: 0.1666666716337204
    shift: 0.0
  }
}
layer {
  name: "Conv_96"
  type: "Convolution"
  bottom: "262"
  top: "263"
  convolution_param {
    num_output: 64
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Add_98"
  type: "Eltwise"
  bottom: "263"
  bottom: "209"
  top: "265"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Clip_99_relu6_relu"
  type: "ReLU"
  bottom: "265"
  top: "Clip_99_relu6_relu_out"
}
layer {
  name: "Clip_99_relu6_thre"
  type: "Threshold"
  bottom: "Clip_99_relu6_relu_out"
  top: "Clip_99_relu6_thre_out"
  threshold_param {
    threshold: 6.0
  }
}
layer {
  name: "Clip_99_relu6_thre_left_power"
  type: "Power"
  bottom: "Clip_99_relu6_thre_out"
  top: "Clip_99_relu6_thre_left_power_out"
  power_param {
    power: 1.0
    scale: -1.0
    shift: 1.0
  }
}
layer {
  name: "Clip_99_relu6_x_mul_thre_out"
  type: "Eltwise"
  bottom: "Clip_99_relu6_relu_out"
  bottom: "Clip_99_relu6_thre_left_power_out"
  top: "Clip_99_relu6_x_mul_thre_out_out"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Clip_99_relu6_thre_right_power"
  type: "Power"
  bottom: "Clip_99_relu6_thre_out"
  top: "Clip_99_relu6_thre_right_power_out"
  power_param {
    power: 1.0
    scale: 6.0
    shift: 0.0
  }
}
layer {
  name: "Clip_99_relu6_add"
  type: "Eltwise"
  bottom: "Clip_99_relu6_x_mul_thre_out_out"
  bottom: "Clip_99_relu6_thre_right_power_out"
  top: "266"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Mul_100"
  type: "Eltwise"
  bottom: "263"
  bottom: "266"
  top: "267"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Div_102"
  type: "Power"
  bottom: "267"
  top: "269"
  power_param {
    power: 1.0
    scale: 0.1666666716337204
    shift: 0.0
  }
}
layer {
  name: "Conv_103"
  type: "Convolution"
  bottom: "269"
  top: "270"
  convolution_param {
    num_output: 64
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Add_105"
  type: "Eltwise"
  bottom: "270"
  bottom: "209"
  top: "272"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Clip_106_relu6_relu"
  type: "ReLU"
  bottom: "272"
  top: "Clip_106_relu6_relu_out"
}
layer {
  name: "Clip_106_relu6_thre"
  type: "Threshold"
  bottom: "Clip_106_relu6_relu_out"
  top: "Clip_106_relu6_thre_out"
  threshold_param {
    threshold: 6.0
  }
}
layer {
  name: "Clip_106_relu6_thre_left_power"
  type: "Power"
  bottom: "Clip_106_relu6_thre_out"
  top: "Clip_106_relu6_thre_left_power_out"
  power_param {
    power: 1.0
    scale: -1.0
    shift: 1.0
  }
}
layer {
  name: "Clip_106_relu6_x_mul_thre_out"
  type: "Eltwise"
  bottom: "Clip_106_relu6_relu_out"
  bottom: "Clip_106_relu6_thre_left_power_out"
  top: "Clip_106_relu6_x_mul_thre_out_out"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Clip_106_relu6_thre_right_power"
  type: "Power"
  bottom: "Clip_106_relu6_thre_out"
  top: "Clip_106_relu6_thre_right_power_out"
  power_param {
    power: 1.0
    scale: 6.0
    shift: 0.0
  }
}
layer {
  name: "Clip_106_relu6_add"
  type: "Eltwise"
  bottom: "Clip_106_relu6_x_mul_thre_out_out"
  bottom: "Clip_106_relu6_thre_right_power_out"
  top: "273"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Mul_107"
  type: "Eltwise"
  bottom: "270"
  bottom: "273"
  top: "274"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Div_109"
  type: "Power"
  bottom: "274"
  top: "276"
  power_param {
    power: 1.0
    scale: 0.1666666716337204
    shift: 0.0
  }
}
layer {
  name: "Conv_110"
  type: "Convolution"
  bottom: "276"
  top: "277"
  convolution_param {
    num_output: 64
    bias_term: true
    group: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Add_112"
  type: "Eltwise"
  bottom: "277"
  bottom: "209"
  top: "279"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Clip_113_relu6_relu"
  type: "ReLU"
  bottom: "279"
  top: "Clip_113_relu6_relu_out"
}
layer {
  name: "Clip_113_relu6_thre"
  type: "Threshold"
  bottom: "Clip_113_relu6_relu_out"
  top: "Clip_113_relu6_thre_out"
  threshold_param {
    threshold: 6.0
  }
}
layer {
  name: "Clip_113_relu6_thre_left_power"
  type: "Power"
  bottom: "Clip_113_relu6_thre_out"
  top: "Clip_113_relu6_thre_left_power_out"
  power_param {
    power: 1.0
    scale: -1.0
    shift: 1.0
  }
}
layer {
  name: "Clip_113_relu6_x_mul_thre_out"
  type: "Eltwise"
  bottom: "Clip_113_relu6_relu_out"
  bottom: "Clip_113_relu6_thre_left_power_out"
  top: "Clip_113_relu6_x_mul_thre_out_out"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Clip_113_relu6_thre_right_power"
  type: "Power"
  bottom: "Clip_113_relu6_thre_out"
  top: "Clip_113_relu6_thre_right_power_out"
  power_param {
    power: 1.0
    scale: 6.0
    shift: 0.0
  }
}
layer {
  name: "Clip_113_relu6_add"
  type: "Eltwise"
  bottom: "Clip_113_relu6_x_mul_thre_out_out"
  bottom: "Clip_113_relu6_thre_right_power_out"
  top: "280"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Mul_114"
  type: "Eltwise"
  bottom: "277"
  bottom: "280"
  top: "281"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Div_116"
  type: "Power"
  bottom: "281"
  top: "283"
  power_param {
    power: 1.0
    scale: 0.1666666716337204
    shift: 0.0
  }
}
layer {
  name: "Add_117"
  type: "Eltwise"
  bottom: "269"
  bottom: "283"
  top: "284"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Conv_118"
  type: "Convolution"
  bottom: "284"
  top: "285"
  convolution_param {
    num_output: 64
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Add_120"
  type: "Eltwise"
  bottom: "285"
  bottom: "209"
  top: "287"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Clip_121_relu6_relu"
  type: "ReLU"
  bottom: "287"
  top: "Clip_121_relu6_relu_out"
}
layer {
  name: "Clip_121_relu6_thre"
  type: "Threshold"
  bottom: "Clip_121_relu6_relu_out"
  top: "Clip_121_relu6_thre_out"
  threshold_param {
    threshold: 6.0
  }
}
layer {
  name: "Clip_121_relu6_thre_left_power"
  type: "Power"
  bottom: "Clip_121_relu6_thre_out"
  top: "Clip_121_relu6_thre_left_power_out"
  power_param {
    power: 1.0
    scale: -1.0
    shift: 1.0
  }
}
layer {
  name: "Clip_121_relu6_x_mul_thre_out"
  type: "Eltwise"
  bottom: "Clip_121_relu6_relu_out"
  bottom: "Clip_121_relu6_thre_left_power_out"
  top: "Clip_121_relu6_x_mul_thre_out_out"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Clip_121_relu6_thre_right_power"
  type: "Power"
  bottom: "Clip_121_relu6_thre_out"
  top: "Clip_121_relu6_thre_right_power_out"
  power_param {
    power: 1.0
    scale: 6.0
    shift: 0.0
  }
}
layer {
  name: "Clip_121_relu6_add"
  type: "Eltwise"
  bottom: "Clip_121_relu6_x_mul_thre_out_out"
  bottom: "Clip_121_relu6_thre_right_power_out"
  top: "288"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Mul_122"
  type: "Eltwise"
  bottom: "285"
  bottom: "288"
  top: "289"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Div_124"
  type: "Power"
  bottom: "289"
  top: "291"
  power_param {
    power: 1.0
    scale: 0.1666666716337204
    shift: 0.0
  }
}
layer {
  name: "Conv_125"
  type: "Convolution"
  bottom: "291"
  top: "292"
  convolution_param {
    num_output: 64
    bias_term: true
    group: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Add_127"
  type: "Eltwise"
  bottom: "292"
  bottom: "209"
  top: "294"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Clip_128_relu6_relu"
  type: "ReLU"
  bottom: "294"
  top: "Clip_128_relu6_relu_out"
}
layer {
  name: "Clip_128_relu6_thre"
  type: "Threshold"
  bottom: "Clip_128_relu6_relu_out"
  top: "Clip_128_relu6_thre_out"
  threshold_param {
    threshold: 6.0
  }
}
layer {
  name: "Clip_128_relu6_thre_left_power"
  type: "Power"
  bottom: "Clip_128_relu6_thre_out"
  top: "Clip_128_relu6_thre_left_power_out"
  power_param {
    power: 1.0
    scale: -1.0
    shift: 1.0
  }
}
layer {
  name: "Clip_128_relu6_x_mul_thre_out"
  type: "Eltwise"
  bottom: "Clip_128_relu6_relu_out"
  bottom: "Clip_128_relu6_thre_left_power_out"
  top: "Clip_128_relu6_x_mul_thre_out_out"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Clip_128_relu6_thre_right_power"
  type: "Power"
  bottom: "Clip_128_relu6_thre_out"
  top: "Clip_128_relu6_thre_right_power_out"
  power_param {
    power: 1.0
    scale: 6.0
    shift: 0.0
  }
}
layer {
  name: "Clip_128_relu6_add"
  type: "Eltwise"
  bottom: "Clip_128_relu6_x_mul_thre_out_out"
  bottom: "Clip_128_relu6_thre_right_power_out"
  top: "295"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Mul_129"
  type: "Eltwise"
  bottom: "292"
  bottom: "295"
  top: "296"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Div_131"
  type: "Power"
  bottom: "296"
  top: "298"
  power_param {
    power: 1.0
    scale: 0.1666666716337204
    shift: 0.0
  }
}
layer {
  name: "Add_132"
  type: "Eltwise"
  bottom: "284"
  bottom: "298"
  top: "299"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Conv_133"
  type: "Convolution"
  bottom: "299"
  top: "300"
  convolution_param {
    num_output: 64
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Add_135"
  type: "Eltwise"
  bottom: "300"
  bottom: "209"
  top: "302"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Clip_136_relu6_relu"
  type: "ReLU"
  bottom: "302"
  top: "Clip_136_relu6_relu_out"
}
layer {
  name: "Clip_136_relu6_thre"
  type: "Threshold"
  bottom: "Clip_136_relu6_relu_out"
  top: "Clip_136_relu6_thre_out"
  threshold_param {
    threshold: 6.0
  }
}
layer {
  name: "Clip_136_relu6_thre_left_power"
  type: "Power"
  bottom: "Clip_136_relu6_thre_out"
  top: "Clip_136_relu6_thre_left_power_out"
  power_param {
    power: 1.0
    scale: -1.0
    shift: 1.0
  }
}
layer {
  name: "Clip_136_relu6_x_mul_thre_out"
  type: "Eltwise"
  bottom: "Clip_136_relu6_relu_out"
  bottom: "Clip_136_relu6_thre_left_power_out"
  top: "Clip_136_relu6_x_mul_thre_out_out"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Clip_136_relu6_thre_right_power"
  type: "Power"
  bottom: "Clip_136_relu6_thre_out"
  top: "Clip_136_relu6_thre_right_power_out"
  power_param {
    power: 1.0
    scale: 6.0
    shift: 0.0
  }
}
layer {
  name: "Clip_136_relu6_add"
  type: "Eltwise"
  bottom: "Clip_136_relu6_x_mul_thre_out_out"
  bottom: "Clip_136_relu6_thre_right_power_out"
  top: "303"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Mul_137"
  type: "Eltwise"
  bottom: "300"
  bottom: "303"
  top: "304"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Div_139"
  type: "Power"
  bottom: "304"
  top: "306"
  power_param {
    power: 1.0
    scale: 0.1666666716337204
    shift: 0.0
  }
}
layer {
  name: "Conv_140"
  type: "Convolution"
  bottom: "306"
  top: "307"
  convolution_param {
    num_output: 64
    bias_term: true
    group: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Add_142"
  type: "Eltwise"
  bottom: "307"
  bottom: "209"
  top: "309"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Clip_143_relu6_relu"
  type: "ReLU"
  bottom: "309"
  top: "Clip_143_relu6_relu_out"
}
layer {
  name: "Clip_143_relu6_thre"
  type: "Threshold"
  bottom: "Clip_143_relu6_relu_out"
  top: "Clip_143_relu6_thre_out"
  threshold_param {
    threshold: 6.0
  }
}
layer {
  name: "Clip_143_relu6_thre_left_power"
  type: "Power"
  bottom: "Clip_143_relu6_thre_out"
  top: "Clip_143_relu6_thre_left_power_out"
  power_param {
    power: 1.0
    scale: -1.0
    shift: 1.0
  }
}
layer {
  name: "Clip_143_relu6_x_mul_thre_out"
  type: "Eltwise"
  bottom: "Clip_143_relu6_relu_out"
  bottom: "Clip_143_relu6_thre_left_power_out"
  top: "Clip_143_relu6_x_mul_thre_out_out"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Clip_143_relu6_thre_right_power"
  type: "Power"
  bottom: "Clip_143_relu6_thre_out"
  top: "Clip_143_relu6_thre_right_power_out"
  power_param {
    power: 1.0
    scale: 6.0
    shift: 0.0
  }
}
layer {
  name: "Clip_143_relu6_add"
  type: "Eltwise"
  bottom: "Clip_143_relu6_x_mul_thre_out_out"
  bottom: "Clip_143_relu6_thre_right_power_out"
  top: "310"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Mul_144"
  type: "Eltwise"
  bottom: "307"
  bottom: "310"
  top: "311"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Div_146"
  type: "Power"
  bottom: "311"
  top: "313"
  power_param {
    power: 1.0
    scale: 0.1666666716337204
    shift: 0.0
  }
}
layer {
  name: "Add_147"
  type: "Eltwise"
  bottom: "299"
  bottom: "313"
  top: "314"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Conv_148"
  type: "Convolution"
  bottom: "314"
  top: "315"
  convolution_param {
    num_output: 64
    bias_term: false
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Conv_149"
  type: "Convolution"
  bottom: "262"
  top: "316"
  convolution_param {
    num_output: 64
    bias_term: false
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Concat_150"
  type: "Concat"
  bottom: "315"
  bottom: "316"
  top: "317"
  concat_param {
    axis: 1
  }
}
layer {
  name: "BatchNormalization_151_bn"
  type: "BatchNorm"
  bottom: "317"
  top: "318"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "BatchNormalization_151"
  type: "Scale"
  bottom: "318"
  top: "318"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "LeakyRelu_152"
  type: "ReLU"
  bottom: "318"
  top: "319"
  relu_param {
    negative_slope: 0.10000000149011612
  }
}
layer {
  name: "Conv_153"
  type: "Convolution"
  bottom: "319"
  top: "320"
  convolution_param {
    num_output: 128
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Add_155"
  type: "Eltwise"
  bottom: "320"
  bottom: "209"
  top: "322"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Clip_156_relu6_relu"
  type: "ReLU"
  bottom: "322"
  top: "Clip_156_relu6_relu_out"
}
layer {
  name: "Clip_156_relu6_thre"
  type: "Threshold"
  bottom: "Clip_156_relu6_relu_out"
  top: "Clip_156_relu6_thre_out"
  threshold_param {
    threshold: 6.0
  }
}
layer {
  name: "Clip_156_relu6_thre_left_power"
  type: "Power"
  bottom: "Clip_156_relu6_thre_out"
  top: "Clip_156_relu6_thre_left_power_out"
  power_param {
    power: 1.0
    scale: -1.0
    shift: 1.0
  }
}
layer {
  name: "Clip_156_relu6_x_mul_thre_out"
  type: "Eltwise"
  bottom: "Clip_156_relu6_relu_out"
  bottom: "Clip_156_relu6_thre_left_power_out"
  top: "Clip_156_relu6_x_mul_thre_out_out"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Clip_156_relu6_thre_right_power"
  type: "Power"
  bottom: "Clip_156_relu6_thre_out"
  top: "Clip_156_relu6_thre_right_power_out"
  power_param {
    power: 1.0
    scale: 6.0
    shift: 0.0
  }
}
layer {
  name: "Clip_156_relu6_add"
  type: "Eltwise"
  bottom: "Clip_156_relu6_x_mul_thre_out_out"
  bottom: "Clip_156_relu6_thre_right_power_out"
  top: "323"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Mul_157"
  type: "Eltwise"
  bottom: "320"
  bottom: "323"
  top: "324"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Div_159"
  type: "Power"
  bottom: "324"
  top: "326"
  power_param {
    power: 1.0
    scale: 0.1666666716337204
    shift: 0.0
  }
}
layer {
  name: "Conv_160"
  type: "Convolution"
  bottom: "326"
  top: "327"
  convolution_param {
    num_output: 256
    bias_term: true
    group: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    dilation: 1
  }
}
layer {
  name: "Add_162"
  type: "Eltwise"
  bottom: "327"
  bottom: "209"
  top: "329"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Clip_163_relu6_relu"
  type: "ReLU"
  bottom: "329"
  top: "Clip_163_relu6_relu_out"
}
layer {
  name: "Clip_163_relu6_thre"
  type: "Threshold"
  bottom: "Clip_163_relu6_relu_out"
  top: "Clip_163_relu6_thre_out"
  threshold_param {
    threshold: 6.0
  }
}
layer {
  name: "Clip_163_relu6_thre_left_power"
  type: "Power"
  bottom: "Clip_163_relu6_thre_out"
  top: "Clip_163_relu6_thre_left_power_out"
  power_param {
    power: 1.0
    scale: -1.0
    shift: 1.0
  }
}
layer {
  name: "Clip_163_relu6_x_mul_thre_out"
  type: "Eltwise"
  bottom: "Clip_163_relu6_relu_out"
  bottom: "Clip_163_relu6_thre_left_power_out"
  top: "Clip_163_relu6_x_mul_thre_out_out"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Clip_163_relu6_thre_right_power"
  type: "Power"
  bottom: "Clip_163_relu6_thre_out"
  top: "Clip_163_relu6_thre_right_power_out"
  power_param {
    power: 1.0
    scale: 6.0
    shift: 0.0
  }
}
layer {
  name: "Clip_163_relu6_add"
  type: "Eltwise"
  bottom: "Clip_163_relu6_x_mul_thre_out_out"
  bottom: "Clip_163_relu6_thre_right_power_out"
  top: "330"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Mul_164"
  type: "Eltwise"
  bottom: "327"
  bottom: "330"
  top: "331"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Div_166"
  type: "Power"
  bottom: "331"
  top: "333"
  power_param {
    power: 1.0
    scale: 0.1666666716337204
    shift: 0.0
  }
}
layer {
  name: "Conv_167"
  type: "Convolution"
  bottom: "333"
  top: "334"
  convolution_param {
    num_output: 128
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Add_169"
  type: "Eltwise"
  bottom: "334"
  bottom: "209"
  top: "336"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Clip_170_relu6_relu"
  type: "ReLU"
  bottom: "336"
  top: "Clip_170_relu6_relu_out"
}
layer {
  name: "Clip_170_relu6_thre"
  type: "Threshold"
  bottom: "Clip_170_relu6_relu_out"
  top: "Clip_170_relu6_thre_out"
  threshold_param {
    threshold: 6.0
  }
}
layer {
  name: "Clip_170_relu6_thre_left_power"
  type: "Power"
  bottom: "Clip_170_relu6_thre_out"
  top: "Clip_170_relu6_thre_left_power_out"
  power_param {
    power: 1.0
    scale: -1.0
    shift: 1.0
  }
}
layer {
  name: "Clip_170_relu6_x_mul_thre_out"
  type: "Eltwise"
  bottom: "Clip_170_relu6_relu_out"
  bottom: "Clip_170_relu6_thre_left_power_out"
  top: "Clip_170_relu6_x_mul_thre_out_out"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Clip_170_relu6_thre_right_power"
  type: "Power"
  bottom: "Clip_170_relu6_thre_out"
  top: "Clip_170_relu6_thre_right_power_out"
  power_param {
    power: 1.0
    scale: 6.0
    shift: 0.0
  }
}
layer {
  name: "Clip_170_relu6_add"
  type: "Eltwise"
  bottom: "Clip_170_relu6_x_mul_thre_out_out"
  bottom: "Clip_170_relu6_thre_right_power_out"
  top: "337"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Mul_171"
  type: "Eltwise"
  bottom: "334"
  bottom: "337"
  top: "338"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Div_173"
  type: "Power"
  bottom: "338"
  top: "340"
  power_param {
    power: 1.0
    scale: 0.1666666716337204
    shift: 0.0
  }
}
layer {
  name: "Conv_174"
  type: "Convolution"
  bottom: "340"
  top: "341"
  convolution_param {
    num_output: 128
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Add_176"
  type: "Eltwise"
  bottom: "341"
  bottom: "209"
  top: "343"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Clip_177_relu6_relu"
  type: "ReLU"
  bottom: "343"
  top: "Clip_177_relu6_relu_out"
}
layer {
  name: "Clip_177_relu6_thre"
  type: "Threshold"
  bottom: "Clip_177_relu6_relu_out"
  top: "Clip_177_relu6_thre_out"
  threshold_param {
    threshold: 6.0
  }
}
layer {
  name: "Clip_177_relu6_thre_left_power"
  type: "Power"
  bottom: "Clip_177_relu6_thre_out"
  top: "Clip_177_relu6_thre_left_power_out"
  power_param {
    power: 1.0
    scale: -1.0
    shift: 1.0
  }
}
layer {
  name: "Clip_177_relu6_x_mul_thre_out"
  type: "Eltwise"
  bottom: "Clip_177_relu6_relu_out"
  bottom: "Clip_177_relu6_thre_left_power_out"
  top: "Clip_177_relu6_x_mul_thre_out_out"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Clip_177_relu6_thre_right_power"
  type: "Power"
  bottom: "Clip_177_relu6_thre_out"
  top: "Clip_177_relu6_thre_right_power_out"
  power_param {
    power: 1.0
    scale: 6.0
    shift: 0.0
  }
}
layer {
  name: "Clip_177_relu6_add"
  type: "Eltwise"
  bottom: "Clip_177_relu6_x_mul_thre_out_out"
  bottom: "Clip_177_relu6_thre_right_power_out"
  top: "344"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Mul_178"
  type: "Eltwise"
  bottom: "341"
  bottom: "344"
  top: "345"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Div_180"
  type: "Power"
  bottom: "345"
  top: "347"
  power_param {
    power: 1.0
    scale: 0.1666666716337204
    shift: 0.0
  }
}
layer {
  name: "Conv_181"
  type: "Convolution"
  bottom: "347"
  top: "348"
  convolution_param {
    num_output: 128
    bias_term: true
    group: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Add_183"
  type: "Eltwise"
  bottom: "348"
  bottom: "209"
  top: "350"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Clip_184_relu6_relu"
  type: "ReLU"
  bottom: "350"
  top: "Clip_184_relu6_relu_out"
}
layer {
  name: "Clip_184_relu6_thre"
  type: "Threshold"
  bottom: "Clip_184_relu6_relu_out"
  top: "Clip_184_relu6_thre_out"
  threshold_param {
    threshold: 6.0
  }
}
layer {
  name: "Clip_184_relu6_thre_left_power"
  type: "Power"
  bottom: "Clip_184_relu6_thre_out"
  top: "Clip_184_relu6_thre_left_power_out"
  power_param {
    power: 1.0
    scale: -1.0
    shift: 1.0
  }
}
layer {
  name: "Clip_184_relu6_x_mul_thre_out"
  type: "Eltwise"
  bottom: "Clip_184_relu6_relu_out"
  bottom: "Clip_184_relu6_thre_left_power_out"
  top: "Clip_184_relu6_x_mul_thre_out_out"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Clip_184_relu6_thre_right_power"
  type: "Power"
  bottom: "Clip_184_relu6_thre_out"
  top: "Clip_184_relu6_thre_right_power_out"
  power_param {
    power: 1.0
    scale: 6.0
    shift: 0.0
  }
}
layer {
  name: "Clip_184_relu6_add"
  type: "Eltwise"
  bottom: "Clip_184_relu6_x_mul_thre_out_out"
  bottom: "Clip_184_relu6_thre_right_power_out"
  top: "351"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Mul_185"
  type: "Eltwise"
  bottom: "348"
  bottom: "351"
  top: "352"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Div_187"
  type: "Power"
  bottom: "352"
  top: "354"
  power_param {
    power: 1.0
    scale: 0.1666666716337204
    shift: 0.0
  }
}
layer {
  name: "Add_188"
  type: "Eltwise"
  bottom: "340"
  bottom: "354"
  top: "355"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Conv_189"
  type: "Convolution"
  bottom: "355"
  top: "356"
  convolution_param {
    num_output: 128
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Add_191"
  type: "Eltwise"
  bottom: "356"
  bottom: "209"
  top: "358"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Clip_192_relu6_relu"
  type: "ReLU"
  bottom: "358"
  top: "Clip_192_relu6_relu_out"
}
layer {
  name: "Clip_192_relu6_thre"
  type: "Threshold"
  bottom: "Clip_192_relu6_relu_out"
  top: "Clip_192_relu6_thre_out"
  threshold_param {
    threshold: 6.0
  }
}
layer {
  name: "Clip_192_relu6_thre_left_power"
  type: "Power"
  bottom: "Clip_192_relu6_thre_out"
  top: "Clip_192_relu6_thre_left_power_out"
  power_param {
    power: 1.0
    scale: -1.0
    shift: 1.0
  }
}
layer {
  name: "Clip_192_relu6_x_mul_thre_out"
  type: "Eltwise"
  bottom: "Clip_192_relu6_relu_out"
  bottom: "Clip_192_relu6_thre_left_power_out"
  top: "Clip_192_relu6_x_mul_thre_out_out"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Clip_192_relu6_thre_right_power"
  type: "Power"
  bottom: "Clip_192_relu6_thre_out"
  top: "Clip_192_relu6_thre_right_power_out"
  power_param {
    power: 1.0
    scale: 6.0
    shift: 0.0
  }
}
layer {
  name: "Clip_192_relu6_add"
  type: "Eltwise"
  bottom: "Clip_192_relu6_x_mul_thre_out_out"
  bottom: "Clip_192_relu6_thre_right_power_out"
  top: "359"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Mul_193"
  type: "Eltwise"
  bottom: "356"
  bottom: "359"
  top: "360"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Div_195"
  type: "Power"
  bottom: "360"
  top: "362"
  power_param {
    power: 1.0
    scale: 0.1666666716337204
    shift: 0.0
  }
}
layer {
  name: "Conv_196"
  type: "Convolution"
  bottom: "362"
  top: "363"
  convolution_param {
    num_output: 128
    bias_term: true
    group: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Add_198"
  type: "Eltwise"
  bottom: "363"
  bottom: "209"
  top: "365"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Clip_199_relu6_relu"
  type: "ReLU"
  bottom: "365"
  top: "Clip_199_relu6_relu_out"
}
layer {
  name: "Clip_199_relu6_thre"
  type: "Threshold"
  bottom: "Clip_199_relu6_relu_out"
  top: "Clip_199_relu6_thre_out"
  threshold_param {
    threshold: 6.0
  }
}
layer {
  name: "Clip_199_relu6_thre_left_power"
  type: "Power"
  bottom: "Clip_199_relu6_thre_out"
  top: "Clip_199_relu6_thre_left_power_out"
  power_param {
    power: 1.0
    scale: -1.0
    shift: 1.0
  }
}
layer {
  name: "Clip_199_relu6_x_mul_thre_out"
  type: "Eltwise"
  bottom: "Clip_199_relu6_relu_out"
  bottom: "Clip_199_relu6_thre_left_power_out"
  top: "Clip_199_relu6_x_mul_thre_out_out"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Clip_199_relu6_thre_right_power"
  type: "Power"
  bottom: "Clip_199_relu6_thre_out"
  top: "Clip_199_relu6_thre_right_power_out"
  power_param {
    power: 1.0
    scale: 6.0
    shift: 0.0
  }
}
layer {
  name: "Clip_199_relu6_add"
  type: "Eltwise"
  bottom: "Clip_199_relu6_x_mul_thre_out_out"
  bottom: "Clip_199_relu6_thre_right_power_out"
  top: "366"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Mul_200"
  type: "Eltwise"
  bottom: "363"
  bottom: "366"
  top: "367"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Div_202"
  type: "Power"
  bottom: "367"
  top: "369"
  power_param {
    power: 1.0
    scale: 0.1666666716337204
    shift: 0.0
  }
}
layer {
  name: "Add_203"
  type: "Eltwise"
  bottom: "355"
  bottom: "369"
  top: "370"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Conv_204"
  type: "Convolution"
  bottom: "370"
  top: "371"
  convolution_param {
    num_output: 128
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Add_206"
  type: "Eltwise"
  bottom: "371"
  bottom: "209"
  top: "373"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Clip_207_relu6_relu"
  type: "ReLU"
  bottom: "373"
  top: "Clip_207_relu6_relu_out"
}
layer {
  name: "Clip_207_relu6_thre"
  type: "Threshold"
  bottom: "Clip_207_relu6_relu_out"
  top: "Clip_207_relu6_thre_out"
  threshold_param {
    threshold: 6.0
  }
}
layer {
  name: "Clip_207_relu6_thre_left_power"
  type: "Power"
  bottom: "Clip_207_relu6_thre_out"
  top: "Clip_207_relu6_thre_left_power_out"
  power_param {
    power: 1.0
    scale: -1.0
    shift: 1.0
  }
}
layer {
  name: "Clip_207_relu6_x_mul_thre_out"
  type: "Eltwise"
  bottom: "Clip_207_relu6_relu_out"
  bottom: "Clip_207_relu6_thre_left_power_out"
  top: "Clip_207_relu6_x_mul_thre_out_out"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Clip_207_relu6_thre_right_power"
  type: "Power"
  bottom: "Clip_207_relu6_thre_out"
  top: "Clip_207_relu6_thre_right_power_out"
  power_param {
    power: 1.0
    scale: 6.0
    shift: 0.0
  }
}
layer {
  name: "Clip_207_relu6_add"
  type: "Eltwise"
  bottom: "Clip_207_relu6_x_mul_thre_out_out"
  bottom: "Clip_207_relu6_thre_right_power_out"
  top: "374"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Mul_208"
  type: "Eltwise"
  bottom: "371"
  bottom: "374"
  top: "375"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Div_210"
  type: "Power"
  bottom: "375"
  top: "377"
  power_param {
    power: 1.0
    scale: 0.1666666716337204
    shift: 0.0
  }
}
layer {
  name: "Conv_211"
  type: "Convolution"
  bottom: "377"
  top: "378"
  convolution_param {
    num_output: 128
    bias_term: true
    group: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Add_213"
  type: "Eltwise"
  bottom: "378"
  bottom: "209"
  top: "380"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Clip_214_relu6_relu"
  type: "ReLU"
  bottom: "380"
  top: "Clip_214_relu6_relu_out"
}
layer {
  name: "Clip_214_relu6_thre"
  type: "Threshold"
  bottom: "Clip_214_relu6_relu_out"
  top: "Clip_214_relu6_thre_out"
  threshold_param {
    threshold: 6.0
  }
}
layer {
  name: "Clip_214_relu6_thre_left_power"
  type: "Power"
  bottom: "Clip_214_relu6_thre_out"
  top: "Clip_214_relu6_thre_left_power_out"
  power_param {
    power: 1.0
    scale: -1.0
    shift: 1.0
  }
}
layer {
  name: "Clip_214_relu6_x_mul_thre_out"
  type: "Eltwise"
  bottom: "Clip_214_relu6_relu_out"
  bottom: "Clip_214_relu6_thre_left_power_out"
  top: "Clip_214_relu6_x_mul_thre_out_out"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Clip_214_relu6_thre_right_power"
  type: "Power"
  bottom: "Clip_214_relu6_thre_out"
  top: "Clip_214_relu6_thre_right_power_out"
  power_param {
    power: 1.0
    scale: 6.0
    shift: 0.0
  }
}
layer {
  name: "Clip_214_relu6_add"
  type: "Eltwise"
  bottom: "Clip_214_relu6_x_mul_thre_out_out"
  bottom: "Clip_214_relu6_thre_right_power_out"
  top: "381"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Mul_215"
  type: "Eltwise"
  bottom: "378"
  bottom: "381"
  top: "382"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Div_217"
  type: "Power"
  bottom: "382"
  top: "384"
  power_param {
    power: 1.0
    scale: 0.1666666716337204
    shift: 0.0
  }
}
layer {
  name: "Add_218"
  type: "Eltwise"
  bottom: "370"
  bottom: "384"
  top: "385"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Conv_219"
  type: "Convolution"
  bottom: "385"
  top: "386"
  convolution_param {
    num_output: 128
    bias_term: false
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Conv_220"
  type: "Convolution"
  bottom: "333"
  top: "387"
  convolution_param {
    num_output: 128
    bias_term: false
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Concat_221"
  type: "Concat"
  bottom: "386"
  bottom: "387"
  top: "388"
  concat_param {
    axis: 1
  }
}
layer {
  name: "BatchNormalization_222_bn"
  type: "BatchNorm"
  bottom: "388"
  top: "389"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0010000000474974513
  }
}
layer {
  name: "BatchNormalization_222"
  type: "Scale"
  bottom: "389"
  top: "389"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "LeakyRelu_223"
  type: "ReLU"
  bottom: "389"
  top: "390"
  relu_param {
    negative_slope: 0.10000000149011612
  }
}
layer {
  name: "Conv_224"
  type: "Convolution"
  bottom: "390"
  top: "391"
  convolution_param {
    num_output: 256
    bias_term: true
    group: 1
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 1
    stride_h: 1
    stride_w: 1
    dilation: 1
  }
}
layer {
  name: "Add_226"
  type: "Eltwise"
  bottom: "391"
  bottom: "209"
  top: "393"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Clip_227_relu6_relu"
  type: "ReLU"
  bottom: "393"
  top: "Clip_227_relu6_relu_out"
}
layer {
  name: "Clip_227_relu6_thre"
  type: "Threshold"
  bottom: "Clip_227_relu6_relu_out"
  top: "Clip_227_relu6_thre_out"
  threshold_param {
    threshold: 6.0
  }
}
layer {
  name: "Clip_227_relu6_thre_left_power"
  type: "Power"
  bottom: "Clip_227_relu6_thre_out"
  top: "Clip_227_relu6_thre_left_power_out"
  power_param {
    power: 1.0
    scale: -1.0
    shift: 1.0
  }
}
layer {
  name: "Clip_227_relu6_x_mul_thre_out"
  type: "Eltwise"
  bottom: "Clip_227_relu6_relu_out"
  bottom: "Clip_227_relu6_thre_left_power_out"
  top: "Clip_227_relu6_x_mul_thre_out_out"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Clip_227_relu6_thre_right_power"
  type: "Power"
  bottom: "Clip_227_relu6_thre_out"
  top: "Clip_227_relu6_thre_right_power_out"
  power_param {
    power: 1.0
    scale: 6.0
    shift: 0.0
  }
}
layer {
  name: "Clip_227_relu6_add"
  type: "Eltwise"
  bottom: "Clip_227_relu6_x_mul_thre_out_out"
  bottom: "Clip_227_relu6_thre_right_power_out"
  top: "394"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Mul_228"
  type: "Eltwise"
  bottom: "391"
  bottom: "394"
  top: "395"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Div_230"
  type: "Power"
  bottom: "395"
  top: "397"
  power_param {
    power: 1.0
    scale: 0.1666666716337204
    shift: 0.0
  }
}
layer {
  name: "Conv_231"
  type: "Convolution"
  bottom: "397"
  top: "398"
  convolution_param {
    num_output: 512
    bias_term: true
    group: 1
    pad_h: 1
    pad_w: 1
    kernel_h: 3
    kernel_w: 3
    stride_h: 2
    stride_w: 2
    dilation: 1
  }
}
layer {
  name: "Add_233"
  type: "Eltwise"
  bottom: "398"
  bottom: "209"
  top: "400"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Clip_234_relu6_relu"
  type: "ReLU"
  bottom: "400"
  top: "Clip_234_relu6_relu_out"
}
layer {
  name: "Clip_234_relu6_thre"
  type: "Threshold"
  bottom: "Clip_234_relu6_relu_out"
  top: "Clip_234_relu6_thre_out"
  threshold_param {
    threshold: 6.0
  }
}
layer {
  name: "Clip_234_relu6_thre_left_power"
  type: "Power"
  bottom: "Clip_234_relu6_thre_out"
  top: "Clip_234_relu6_thre_left_power_out"
  power_param {
    power: 1.0
    scale: -1.0
    shift: 1.0
  }
}
layer {
  name: "Clip_234_relu6_x_mul_thre_out"
  type: "Eltwise"
  bottom: "Clip_234_relu6_relu_out"
  bottom: "Clip_234_relu6_thre_left_power_out"
  top: "Clip_234_relu6_x_mul_thre_out_out"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Clip_234_relu6_thre_right_power"
  type: "Power"
  bottom: "Clip_234_relu6_thre_out"
  top: "Clip_234_relu6_thre_right_power_out"
  power_param {
    power: 1.0
    scale: 6.0
    shift: 0.0
  }
}
layer {
  name: "Clip_234_relu6_add"
  type: "Eltwise"
  bottom: "Clip_234_relu6_x_mul_thre_out_out"
  bottom: "Clip_234_relu6_thre_right_power_out"
  top: "401"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "Mul_235"
  type: "Eltwise"
  bottom: "398"
  bottom: "401"
  top: "402"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "Div_237"
  type: "Power"
  bottom: "402"
  top: "404"
  power_param {
    power: 1.0
    scale: 0.1666666716337204
    shift: 0.0
  }
}
layer {
